# Pandas

__Import Pandas __

In [1]:
import pandas as pd

In [2]:
data = {'Name':['Bill','Dan','Tony','Mark'],
         'Age':[28,29,31,27],   
         'Salary':[2000,2500,2100,2200]}
         
obj = pd.DataFrame(data)
obj

   Name  Age  Salary
0  Bill   28    2000
1   Dan   29    2500
2  Tony   31    2100
3  Mark   27    2200

In [3]:
# Prints the data of a specific column
obj['Age']

0    28
1    29
2    31
3    27
Name: Age, dtype: int64

In [4]:
# Prints the columns of the dataframe
obj.columns

Index(['Name', 'Age', 'Salary'], dtype='object')

In [5]:
# Returns the data as a 2d array
obj.values

array([['Bill', 28, 2000],
       ['Dan', 29, 2500],
       ['Tony', 31, 2100],
       ['Mark', 27, 2200]], dtype=object)

In [6]:
# Drops a specific row
obj.drop(1)

   Name  Age  Salary
0  Bill   28    2000
2  Tony   31    2100
3  Mark   27    2200

In [7]:
# Drops a specific column
obj.drop('Age',axis=1)

   Name  Salary
0  Bill    2000
1   Dan    2500
2  Tony    2100
3  Mark    2200

__Indexing, Selection, and Filtering__

In [8]:
# Gives specified indexing to your rows
data = pd.DataFrame(data, 
    index=['emp1','emp2','emp3','emp4'])
data

      Name  Age  Salary
emp1  Bill   28    2000
emp2   Dan   29    2500
emp3  Tony   31    2100
emp4  Mark   27    2200

In [9]:
# Indexing format
# data[rows,columns]

1. Column selection

In [10]:
data[['Age','Name']]

      Age  Name
emp1   28  Bill
emp2   29   Dan
emp3   31  Tony
emp4   27  Mark

In [11]:
data.loc[:,['Age','Name']]

      Age  Name
emp1   28  Bill
emp2   29   Dan
emp3   31  Tony
emp4   27  Mark

In [12]:
# If we don't know the column name
data.iloc[:,[0,1]]

      Name  Age
emp1  Bill   28
emp2   Dan   29
emp3  Tony   31
emp4  Mark   27

2. Row Selection

In [13]:
# If we know the index name
# prints indexes 0,1,2
data.loc['emp1':'emp3',:]

      Name  Age  Salary
emp1  Bill   28    2000
emp2   Dan   29    2500
emp3  Tony   31    2100

In [15]:
# If we don't know index name
# prints indexes 0 and 1 excludes the last one
data.iloc[0:2,:]

      Name  Age  Salary
emp1  Bill   28    2000
emp2   Dan   29    2500

3. Mixed selection

In [16]:
data.loc['emp1':'emp3',['Name','Age']]

      Name  Age
emp1  Bill   28
emp2   Dan   29
emp3  Tony   31

In [17]:
# prints row no. 0,2,3 and column no. 0 and 2 
data.iloc[[0,2,3],[0,2]]

      Name  Salary
emp1  Bill    2000
emp3  Tony    2100
emp4  Mark    2200

__Filtering Data__

In [18]:
# prints Name and Salary of those emloyees
# whose age is greater than 28
data.loc[data.Age > 28,['Name','Salary']]

      Name  Salary
emp2   Dan    2500
emp3  Tony    2100

__DESCRIPTIVE STATISTICS__

In [19]:
# prints multiple statistics
data.describe()

             Age      Salary
count   4.000000     4.00000
mean   28.750000  2200.00000
std     1.707825   216.02469
min    27.000000  2000.00000
25%    27.750000  2075.00000
50%    28.500000  2150.00000
75%    29.500000  2275.00000
max    31.000000  2500.00000

In [20]:
# prints minimum age of employee
data.loc[:,'Age'].min()

27

__HANDLING MISSING DATA__

In [21]:
data = pd.DataFrame([[2.3,3.3,float('nan')],[7.5,float('nan'),9.8],
             [float('nan'),2.2,6.8],[5.6,9.2,7.4],
              [float('nan'),float('nan'),float('nan')]])
data

     0    1    2
0  2.3  3.3  NaN
1  7.5  NaN  9.8
2  NaN  2.2  6.8
3  5.6  9.2  7.4
4  NaN  NaN  NaN

1. Filtering missing data

In [22]:
# Drop rows with null values
data.dropna()

     0    1    2
3  5.6  9.2  7.4

In [23]:
# Drop row with all null values
data.dropna(how='all')

     0    1    2
0  2.3  3.3  NaN
1  7.5  NaN  9.8
2  NaN  2.2  6.8
3  5.6  9.2  7.4

2. Filling missing data

In [24]:
# Fill null values with 0
data.fillna(0)

     0    1    2
0  2.3  3.3  0.0
1  7.5  0.0  9.8
2  0.0  2.2  6.8
3  5.6  9.2  7.4
4  0.0  0.0  0.0

In [25]:
# Fill null values with mean
data.fillna(data.mean())

          0    1    2
0  2.300000  3.3  8.0
1  7.500000  4.9  9.8
2  5.133333  2.2  6.8
3  5.600000  9.2  7.4
4  5.133333  4.9  8.0

In [26]:
# Null values for specific column
data.fillna({0:2.5, 1:3.0, 2:5.5})

     0    1    2
0  2.3  3.3  5.5
1  7.5  3.0  9.8
2  2.5  2.2  6.8
3  5.6  9.2  7.4
4  2.5  3.0  5.5

__READING AND WRITING FILES__

In [ ]:
# Reads csv file
data = pd.read_csv('data.csv')

In [ ]:
# Prints top 5 rows
data.head()

File Type     Reader

* CSV:            read_csv
* JSON:           read_json 
* MS Excel:       read_excel
* SQL:            read_sql
* HTML:           read_html

In [ ]:
# Saves the dataframe to a csv file
pd.DataFrame(data).to_csv('myfile.csv')